In [30]:
import numpy as np
import pandas as pd

- 키워드
- 마우스
<div > 
    <b> 볼드체</b>

In [27]:
# JSON(JavaScriptObjectNoation) : 경량 데이터 교환방식

In [47]:
import json

In [48]:
obj="""{"name":"scott","language":"python","db":"oracle"}"""

In [50]:
result = json.loads(obj)
result

{'db': 'oracle', 'language': 'python', 'name': 'scott'}

In [53]:
url = "http://192.168.0.68/share/data/data.txt"
url

'http://192.168.0.68/share/data/data.txt'

In [51]:
import requests

In [55]:
resp = requests.get(url)
resp

In [56]:
data = resp.json()
data

{'age': [22, 30], 'job': ['manager', 'analyst'], 'name': ['scott', 'smith']}

In [115]:
#db에서 데이터 가져오기
#Cx_Oracle
import cx_Oracle as co 
from datetime import datetime

In [59]:
# dsn (Data Source Name)
co.makedsn("서버ip","통신포트","서비스명")

'(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=서버ip)(PORT=통신포트))(CONNECT_DATA=(SID=서비스명)))'

In [63]:
dsnString = co.makedsn("192.168.0.68","1521",service_name="orcl")
dsnString

'(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=192.168.0.68)(PORT=1521))(CONNECT_DATA=(SERVICE_NAME=orcl)))'

In [104]:

conn = co.connect(user = 'scott',password='tiger',dsn = dsnString)
conn

In [109]:
#pd.read_sql("쿼리문",연결객체)
query_result = pd.read_sql("select * from emp",conn)
query_result

    EMPNO   ENAME        JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1982-12-09  3630.0     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0 1983-01-12  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN      10

In [108]:
type(query_result)

pandas.core.frame.DataFrame

In [112]:
conn.close()
#다 사용했다면 연결 닫기 (자원 반납)

DatabaseError: DPI-1010: not connected

In [119]:
# def 함수명(매개변수):
#     처리할 코드 1
#     처리할 코드 2
def query_OracleSQL(query):
#     지금시간 측정  
    startTime = datetime.now()

#    연결할 쿼리문 
    dsnString = co.makedsn("192.168.0.68","1521",service_name="orcl")
    conn = co.connect(user = 'scott',password='tiger',dsn = dsnString)
    query_result = pd.read_sql(query,conn)
    conn.close()
#     완료시간 측정
    endTime = datetime.now()
    print("시작시간 :" , str(startTime))
    print("종료시간 :" , str(endTime))
    print("경과시간 :" , str(endTime-startTime))
    return query_result

In [121]:
dept = query_OracleSQL('select * from dept')
dept

시작시간 : 2020-10-13 15:12:27.476096
종료시간 : 2020-10-13 15:12:27.542154
경과시간 : 0:00:00.066058

   DEPTNO       DNAME       LOC
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [122]:
#사원의 급여 합계, 평균

In [142]:
emp_sal = query_OracleSQL('select sal from emp')
emp_sal
emp_sal.SAL

sum_sal = 0
for i in emp_sal['SAL']:
    sum_sal+= i 
avg_sal = sum_sal/len(emp_sal['SAL'])

print(sum_sal)
print(avg_sal)
# query_OracleSQL('select sum(sal),avg(sal) from emp')

시작시간 : 2020-10-13 15:27:50.940609
종료시간 : 2020-10-13 15:27:51.002379
경과시간 : 0:00:00.061770
29655.0
2118.214285714286

In [148]:
print(np.sum(emp_sal.SAL))
print(np.mean(emp_sal.SAL))

29655.0
2118.214285714286

In [154]:
def insert_OracleSQL(data):
# DSN 설정
    dsnString = co.makedsn("192.168.0.68","1521",service_name="orcl")
# connection
    conn = co.connect(user = 'scott',password='tiger',dsn = dsnString)
# cursor()
    cur = conn.cursor()
#  ' : '' bind변수 
    sql = "insert into dept values ( :1,:2,:3)"
# excute()
    cur.execute(sql,data)
# commit()
    conn.commit()
# close()
    conn.close()
#DNS(Domain Name Server)
insert_OracleSQL((98,'aaa','bbb'))
query_OracleSQL('select * from dept')

시작시간 : 2020-10-13 16:15:24.603652
종료시간 : 2020-10-13 16:15:24.651043
경과시간 : 0:00:00.047391

   DEPTNO       DNAME       LOC
0      98         aaa       bbb
1      98         aaa       bbb
2      98         aaa       bbb
3      98         AAA       BBB
4      98         aaa       bbb
5      98         aaa       bbb
6      10  ACCOUNTING  NEW YORK
7      20    RESEARCH    DALLAS
8      30       SALES   CHICAGO
9      40  OPERATIONS    BOSTON

In [167]:
cat = pd.read_csv('cat.csv',header=None)
cat
# index_col=0

   0          1       2
0  3  streetcat  street
1  4     catcat      go
2  5       hong   korea

In [164]:
type(cat)

pandas.core.frame.DataFrame

In [165]:
for i in cat.iterrows():
    print(type(i))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [177]:
for idx, i in cat.iterrows():
    insert_OracleSQL(i)

In [178]:
query_OracleSQL('select * from dept')

시작시간 : 2020-10-13 16:43:13.729667
종료시간 : 2020-10-13 16:43:13.774591
경과시간 : 0:00:00.044924

    DEPTNO       DNAME       LOC
0        4      catcat      yyyy
1        4      catcat        go
2       98         aaa       bbb
3       98         aaa       bbb
4       98         aaa       bbb
5       98         AAA       BBB
6       98         aaa       bbb
7       98         aaa       bbb
8        3   streetcat    street
9        5       hicat      gsat
10       3   streetcat    street
11       5        hong     korea
12      10  ACCOUNTING  NEW YORK
13      20    RESEARCH    DALLAS
14      30       SALES   CHICAGO
15      40  OPERATIONS    BOSTON

In [183]:
def update_OracleSQL(data):
    #DSN
    dsnString = co.makedsn("192.168.0.68","1521",service_name="orcl")
    #connection
    conn = co.connect(user ='scott',password ='tiger',dsn =dsnString)
     #cursor
    cur = conn.cursor()
     #SQL: dept 부서명, 위치
    sql = "update dept set dname = :1 ,loc =:2 where deptno = :3"
    #execute
    cur.execute(sql,data)
    #commit
    conn.commit()
    #close
    conn.close()
update_OracleSQL(('AI','JEJU',10))

In [186]:
def delete_Oracle(data):
    dsnString = co.makedsn("192.168.0.68","1521",service_name="orcl")
    conn = co.connect(user ='scott',password ='tiger',dsn = dsnString)
    cur = conn.cursor()
    sql = 'delete from dept where deptno = :1 '
    cur.execute(sql,data)
    conn.commit()
    conn.close()
 

delete_Oracle((10,))

IndentationError: unindent does not match any outer indentation level (<ipython-input-186-7257a1ec6737>, line 9)